gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/*
--------------------------------------------------------------------------
SIMULATOR - Simulator
--------------------------------------------------------------------------
*/

/* Simulator  */
typedef struct SIMULATOR_struct
{
    register8_t SIMCTRL0;  /* Simulator Control Register 0 */
    register8_t SIMCTRL1;  /* Simulator Control Register 1 */
} SIMULATOR_t;


/*
--------------------------------------------------------------------------
SLEEP - Sleep Controller
--------------------------------------------------------------------------
*/

/* Sleep Controller */
typedef struct SLEEP_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[1];
} SLEEP_t;

/* Sleep Mode */
typedef enum SLEEP_SMODE_enum
{
    SLEEP_SMODE_IDLE_gc = (0x00<<1),  /* Idle mode */
    SLEEP_SMODE_PSAVE_gc = (0x01<<1),  /* Power-save Mode */
} SLEEP_SMODE_t;

#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_PWR_SAVE (0x01<<1)
/*
--------------------------------------------------------------------------
STYLUSCOM - Stylus Communication Interface
--------------------------------------------------------------------------
*/

/* Stylus Communication Interface */
typedef struct STYLUSCOM_struct
{
    register8_t RXDETA;  /* Receiver Detection Configuration A */
    register8_t RXDETB;  /* Receiver Detection Configuration B */
    register8_t RXDETC;  /* Receiver Detection Configuration C */
    register8_t RXDETD;  /* Receiver Detection Configuration D */
    register8_t RXDETE;  /* Receiver Detection Configuration E */
    register8_t RXDETF;  /* Receiver Detection Configuration F */
    register8_t TMCTRLA;  /* Testmode Control register A */
    register8_t TMCTRLB;  /* Testmode Control register */
    register8_t TMPEAK;  /* Peak Detector Testmode register */
    register8_t reserved_1[1];
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t CTRLC;  /* Control Register C */
    register8_t CTRLD;  /* Control Register D */
    register8_t CTRLE;  /* Control Register E */
    register8_t CTRLF;  /* Control Register F */
    register8_t EDFILT;  /* Edge detector filter */
    register8_t TDS;  /* Transmit Data Size */
    register8_t TCNT;  /* Transmit Counter */
    register8_t TDLYINIT;  /* Transmit Delay Initial value */
    register8_t TDLYCLAMP;  /* Transmit Delay for Receiver Clamp Tipe */
    register8_t TDLYRXDIS;  /* Transmit Delay for Receiver Disable */
    register8_t TDLYCNT;  /* Transmit Delay Counter */
    register8_t TRCNT;  /* Transmit Repeat Counter */
    register8_t TREP;  /* Transmission Repeat */
    register8_t RTWEXPMI;  /* Receive Timer Window Expected Mark period, Initial value */
    register8_t RTWEXPSI;  /* Receive Timer Window Expected Space period, Initial value */
    register8_t reserved_2[1];
    register8_t RTWEXPMUL;  /* Receive Timer Window Expected Mark period Used Low */
    register8_t RTWEXPMUH;  /* Receive Timer Window Expected Mark period Used High */
    register8_t RTWEXPSUL;  /* Receive Timer Window Expected Space period Used Low */
    register8_t RTWEXPSUH;  /* Receive Timer Window Expected Space period Used High */
    register8_t RTWSM;  /* Receive Timer Window Size Min */
    register8_t RTWSI;  /* Receive Timer Window Size for half-period - Initial value */
    register8_t RTWSU;  /* Receive Timer Window Size Used */
    register8_t reserved_3[1];
    register8_t RTCNT0L;  /* Receive Timer/Counter 0 register L */
    register8_t RTCNT0H;  /* Receive Timer/Counter 0 register H */
    register8_t RTCNT1L;  /* Receive Timer/Counter 1 register L */
    register8_t RTCNT1H;  /* Receive Timer/Counter 1 register H */
    register8_t RT0CL;  /* Receive Timer 0 Capture Register L */
    register8_t RT0CH;  /* Receive Timer 0 Capture Register H */
    register8_t RT1CL;  /* Receive Timer 0 Capture Register L */
    register8_t RT1CH;  /* Receive Timer 0 Capture Register H */
    register8_t TEMP;  /* Temporary register */
    register8_t TDR0;  /* Transmit Data Register 0 */
    register8_t TDR1;  /* Transmit Data Register 1 */
    register8_t TDR2;  /* Transmit Data Register 2 */
    register8_t TDR3;  /* Transmit Data Register 3 */
    register8_t TDR4;  /* Transmit Data Register 4 */
    register8_t TDR5;  /* Transmit Data Register 5 */
    register8_t TDR6;  /* Transmit Data Register 6 */
    register8_t TDR7;  /* Transmit Data Register 7 */
    register8_t INTCTRLA;  /* Interrupt Control register A */
    register8_t INTCTRLB;  /* Interrupt Control register B */
    register8_t INTDBCTRL;  /* Interrupt Debug Control register */
    register8_t INTFLAGS;  /* Interrupt Flag register */
    register8_t STATUS;  /* Status register */
    register8_t reserved_4[6];
} STYLUSCOM_t;


/*
--------------------------------------------------------------------------
TIM8_16 - Timer 8/16 bit
--------------------------------------------------------------------------
*/

/* Timer 8/16 bit */
typedef struct TIM8_16_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTMSK;  /* Interrupt Mask Register */
    register8_t STATUS;  /* Status Register */
    register8_t TEMP;  /* Temporary Register */
    register8_t reserved_1[3];
    register8_t COUNTL;  /* Count Register Low Byte */
    register8_t COUNTH;  /* Count Register High Byte */
    register8_t OCRA;  /* Output Compare Register A */
    register8_t OCRB;  /* Output Compare Register B */
    register8_t reserved_2[4];
} TIM8_16_t;

/* Clock Select */
typedef enum TIM8_16_CS_enum
{
    TIM8_16_CS_STOPPED_gc = (0x00<<0),  /* No clock selected */
    TIM8_16_CS_CLKIO_gc = (0x01<<0),  /* clkIO - No prescaling */
    TIM8_16_CS_CLKIO_DIV8_gc = (0x02<<0),  /* clkIO/8 from prescaling */
    TIM8_16_CS_CLKIO_DIV64_gc = (0x03<<0),  /* clkIO/64 from prescaling */
    TIM8_16_CS_CLKIO_DIV256_gc = (0x04<<0),  /* clkIO/256 from prescaling */
    TIM8_16_CS_CLKIO_DIV1024_gc = (0x05<<0),  /* clkIO/1024 from prescaling */
    TIM8_16_CS_8U6_gc = (0x06<<0),  /* 8us clock selected */
    TIM8_16_CS_16U_gc = (0x07<<0),  /* 16us clock selected */
    TIM8_16_CS_64U_gc = (0x08<<0),  /* 64us clock selected */
    TIM8_16_CS_256U_gc = (0x09<<0),  /* 256us clock selected */
    TIM8_16_CS_1M_gc = (0x0A<<0),  /* 1ms clock selected */
    TIM8_16_CS_4M_gc = (0x0B<<0),  /* 4ms clock selected */
    TIM8_16_CS_16M_gc = (0x0C<<0),  /* 16ms clock selected */
    TIM8_16_CS_65M_gc = (0x0D<<0),  /* 65ms clock selected */
    TIM8_16_CS_262M_gc = (0x0E<<0),  /* 262ms clock selected */
    TIM8_16_CS_1S_gc = (0x0F<<0),  /* 1s clock selected */
} TIM8_16_CS_t;

