gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/* CLK.ULPRCCALL  bit masks and bit positions */
/* CLK_CAL  is already defined. */

/* CLK.ULPRCCALH  bit masks and bit positions */
/* CLK_CAL  is already defined. */

/* CLK.OSCTST  bit masks and bit positions */
#define CLK_ULPRCEOV_bm  0x01  /* ULP RC Oscillator Enable Override Value bit mask. */
#define CLK_ULPRCEOV_bp  0  /* ULP RC Oscillator Enable Override Value bit position. */
#define CLK_ULPRCEOE_bm  0x02  /* ULP RC Oscillator Enable Override Enable bit mask. */
#define CLK_ULPRCEOE_bp  1  /* ULP RC Oscillator Enable Override Enable bit position. */
#define CLK_FRCEOV_bm  0x04  /* Fast RC Oscillator Enable Override Value bit mask. */
#define CLK_FRCEOV_bp  2  /* Fast RC Oscillator Enable Override Value bit position. */
#define CLK_FRCEOE_bm  0x08  /* Fast RC Oscillator Enable Override Enable bit mask. */
#define CLK_FRCEOE_bp  3  /* Fast RC Oscillator Enable Override Enable bit position. */
#define CLK_TIMICPSEL_bm  0x10  /* Timer Input Capture Select bit mask. */
#define CLK_TIMICPSEL_bp  4  /* Timer Input Capture Select bit position. */
#define CLK_TIMICPEN_bm  0x20  /* Timer Input Capture Enable bit mask. */
#define CLK_TIMICPEN_bp  5  /* Timer Input Capture Enable bit position. */

/* CPS - Capacitive Pressure Sensing Interface */
/* CPS.CMD  bit masks and bit positions */
#define CPS_START_bm  0x01  /* Input data bit mask. */
#define CPS_START_bp  0  /* Input data bit position. */
#define CPS_SWRST_bm  0x02  /* SW Reset bit mask. */
#define CPS_SWRST_bp  1  /* SW Reset bit position. */

/* CPS.CTRLA  bit masks and bit positions */
#define CPS_ACEN_bm  0x01  /* Checsum bit mask. */
#define CPS_ACEN_bp  0  /* Checsum bit position. */
#define CPS_BIASEN_bm  0x02  /* Analog Comparator Enable bit mask. */
#define CPS_BIASEN_bp  1  /* Analog Comparator Enable bit position. */
#define CPS_IDACEN_bm  0x04  /* Current DAC Enable bit mask. */
#define CPS_IDACEN_bp  2  /* Current DAC Enable bit position. */
#define CPS_SLIEN_bm  0x10  /* S-line Enable bit mask. */
#define CPS_SLIEN_bp  4  /* S-line Enable bit position. */
#define CPS_TIMOVR_bm  0x20  /* Timer Override bit mask. */
#define CPS_TIMOVR_bp  5  /* Timer Override bit position. */
#define CPS_INTLVL_gm  0xC0  /* Interrupt Level group mask. */
#define CPS_INTLVL_gp  6  /* Interrupt Level group position. */
#define CPS_INTLVL0_bm  (1<<6)  /* Interrupt Level bit 0 mask. */
#define CPS_INTLVL0_bp  6  /* Interrupt Level bit 0 position. */
#define CPS_INTLVL1_bm  (1<<7)  /* Interrupt Level bit 1 mask. */
#define CPS_INTLVL1_bp  7  /* Interrupt Level bit 1 position. */

/* CPS.CTRLB  bit masks and bit positions */
#define CPS_S20DEN_bm  0x01  /* Sink 20uA Dummy Enable bit mask. */
#define CPS_S20DEN_bp  0  /* Sink 20uA Dummy Enable bit position. */
#define CPS_S20GEN_bm  0x02  /* Sink 20uA Ground Enable bit mask. */
#define CPS_S20GEN_bp  1  /* Sink 20uA Ground Enable bit position. */
#define CPS_S20YEN_bm  0x04  /* Sinc 20uA Yline Enable bit mask. */
#define CPS_S20YEN_bp  2  /* Sinc 20uA Yline Enable bit position. */
#define CPS_S30DEN_bm  0x08  /* Sink 30uA Dummy Enable bit mask. */
#define CPS_S30DEN_bp  3  /* Sink 30uA Dummy Enable bit position. */
#define CPS_S30GEN_bm  0x10  /* Sink 30uA Ground Enable bit mask. */
#define CPS_S30GEN_bp  4  /* Sink 30uA Ground Enable bit position. */
#define CPS_S30YEN_bm  0x20  /* Sinc 30uA Yline Enable bit mask. */
#define CPS_S30YEN_bp  5  /* Sinc 30uA Yline Enable bit position. */
#define CPS_ACHS_bm  0x40  /* Analog Comparator Hysteresis bit mask. */
#define CPS_ACHS_bp  6  /* Analog Comparator Hysteresis bit position. */
#define CPS_CAPEN_bm  0x80  /* Cap Enable bit mask. */
#define CPS_CAPEN_bp  7  /* Cap Enable bit position. */

/* CPS.CTRLC  bit masks and bit positions */
#define CPS_VDAC_gm  0x0F  /* Voltage DAC Setting group mask. */
#define CPS_VDAC_gp  0  /* Voltage DAC Setting group position. */
#define CPS_VDAC0_bm  (1<<0)  /* Voltage DAC Setting bit 0 mask. */
#define CPS_VDAC0_bp  0  /* Voltage DAC Setting bit 0 position. */
#define CPS_VDAC1_bm  (1<<1)  /* Voltage DAC Setting bit 1 mask. */
#define CPS_VDAC1_bp  1  /* Voltage DAC Setting bit 1 position. */
#define CPS_VDAC2_bm  (1<<2)  /* Voltage DAC Setting bit 2 mask. */
#define CPS_VDAC2_bp  2  /* Voltage DAC Setting bit 2 position. */
#define CPS_VDAC3_bm  (1<<3)  /* Voltage DAC Setting bit 3 mask. */
#define CPS_VDAC3_bp  3  /* Voltage DAC Setting bit 3 position. */

/* CPS.CTRLD  bit masks and bit positions */
#define CPS_MUXEN_gm  0x03  /* MUX Enable group mask. */
#define CPS_MUXEN_gp  0  /* MUX Enable group position. */
#define CPS_MUXEN0_bm  (1<<0)  /* MUX Enable bit 0 mask. */
#define CPS_MUXEN0_bp  0  /* MUX Enable bit 0 position. */
#define CPS_MUXEN1_bm  (1<<1)  /* MUX Enable bit 1 mask. */
#define CPS_MUXEN1_bp  1  /* MUX Enable bit 1 position. */

/* CPS.STATUS  bit masks and bit positions */
#define CPS_CMPIF_bm  0x01  /* Analog Comparator Interrupt Flag bit mask. */
#define CPS_CMPIF_bp  0  /* Analog Comparator Interrupt Flag bit position. */
#define CPS_BUSY_bm  0x40  /* Busy Status bit mask. */
#define CPS_BUSY_bp  6  /* Busy Status bit position. */
#define CPS_ACOUT_bm  0x80  /* Analog Comparator Output bit mask. */
#define CPS_ACOUT_bp  7  /* Analog Comparator Output bit position. */

/* CPS.IDACZL  bit masks and bit positions */
#define CPS_IDACZ_gm  0xFF  /* Current DAC Zero Level Low Byte group mask. */
#define CPS_IDACZ_gp  0  /* Current DAC Zero Level Low Byte group position. */
#define CPS_IDACZ0_bm  (1<<0)  /* Current DAC Zero Level Low Byte bit 0 mask. */
#define CPS_IDACZ0_bp  0  /* Current DAC Zero Level Low Byte bit 0 position. */
#define CPS_IDACZ1_bm  (1<<1)  /* Current DAC Zero Level Low Byte bit 1 mask. */
#define CPS_IDACZ1_bp  1  /* Current DAC Zero Level Low Byte bit 1 position. */
#define CPS_IDACZ2_bm  (1<<2)  /* Current DAC Zero Level Low Byte bit 2 mask. */
#define CPS_IDACZ2_bp  2  /* Current DAC Zero Level Low Byte bit 2 position. */
#define CPS_IDACZ3_bm  (1<<3)  /* Current DAC Zero Level Low Byte bit 3 mask. */
#define CPS_IDACZ3_bp  3  /* Current DAC Zero Level Low Byte bit 3 position. */
#define CPS_IDACZ4_bm  (1<<4)  /* Current DAC Zero Level Low Byte bit 4 mask. */
#define CPS_IDACZ4_bp  4  /* Current DAC Zero Level Low Byte bit 4 position. */
#define CPS_IDACZ5_bm  (1<<5)  /* Current DAC Zero Level Low Byte bit 5 mask. */
#define CPS_IDACZ5_bp  5  /* Current DAC Zero Level Low Byte bit 5 position. */
#define CPS_IDACZ6_bm  (1<<6)  /* Current DAC Zero Level Low Byte bit 6 mask. */
#define CPS_IDACZ6_bp  6  /* Current DAC Zero Level Low Byte bit 6 position. */
#define CPS_IDACZ7_bm  (1<<7)  /* Current DAC Zero Level Low Byte bit 7 mask. */
#define CPS_IDACZ7_bp  7  /* Current DAC Zero Level Low Byte bit 7 position. */

/* CPS.IDACZH  bit masks and bit positions */
/* CPS_IDACZ  is already defined. */

/* CPS.IDACL  bit masks and bit positions */
#define CPS_IDAC_gm  0xFF  /* Current DAC Level Low Byte group mask. */
#define CPS_IDAC_gp  0  /* Current DAC Level Low Byte group position. */
#define CPS_IDAC0_bm  (1<<0)  /* Current DAC Level Low Byte bit 0 mask. */
#define CPS_IDAC0_bp  0  /* Current DAC Level Low Byte bit 0 position. */
#define CPS_IDAC1_bm  (1<<1)  /* Current DAC Level Low Byte bit 1 mask. */
#define CPS_IDAC1_bp  1  /* Current DAC Level Low Byte bit 1 position. */
#define CPS_IDAC2_bm  (1<<2)  /* Current DAC Level Low Byte bit 2 mask. */
#define CPS_IDAC2_bp  2  /* Current DAC Level Low Byte bit 2 position. */
#define CPS_IDAC3_bm  (1<<3)  /* Current DAC Level Low Byte bit 3 mask. */
#define CPS_IDAC3_bp  3  /* Current DAC Level Low Byte bit 3 position. */
#define CPS_IDAC4_bm  (1<<4)  /* Current DAC Level Low Byte bit 4 mask. */
#define CPS_IDAC4_bp  4  /* Current DAC Level Low Byte bit 4 position. */
#define CPS_IDAC5_bm  (1<<5)  /* Current DAC Level Low Byte bit 5 mask. */
#define CPS_IDAC5_bp  5  /* Current DAC Level Low Byte bit 5 position. */
#define CPS_IDAC6_bm  (1<<6)  /* Current DAC Level Low Byte bit 6 mask. */
#define CPS_IDAC6_bp  6  /* Current DAC Level Low Byte bit 6 position. */
#define CPS_IDAC7_bm  (1<<7)  /* Current DAC Level Low Byte bit 7 mask. */
#define CPS_IDAC7_bp  7  /* Current DAC Level Low Byte bit 7 position. */

/* CPS.IDACH  bit masks and bit positions */
/* CPS_IDAC  is already defined. */

/* CPU - CPU */
/* CPU.CCP  bit masks and bit positions */
#define CPU_CCP_gm  0xFF  /* CCP signature group mask. */
#define CPU_CCP_gp  0  /* CCP signature group position. */
#define CPU_CCP0_bm  (1<<0)  /* CCP signature bit 0 mask. */
#define CPU_CCP0_bp  0  /* CCP signature bit 0 position. */
#define CPU_CCP1_bm  (1<<1)  /* CCP signature bit 1 mask. */
#define CPU_CCP1_bp  1  /* CCP signature bit 1 position. */
#define CPU_CCP2_bm  (1<<2)  /* CCP signature bit 2 mask. */
#define CPU_CCP2_bp  2  /* CCP signature bit 2 position. */
#define CPU_CCP3_bm  (1<<3)  /* CCP signature bit 3 mask. */
#define CPU_CCP3_bp  3  /* CCP signature bit 3 position. */
#define CPU_CCP4_bm  (1<<4)  /* CCP signature bit 4 mask. */
#define CPU_CCP4_bp  4  /* CCP signature bit 4 position. */
#define CPU_CCP5_bm  (1<<5)  /* CCP signature bit 5 mask. */
#define CPU_CCP5_bp  5  /* CCP signature bit 5 position. */
#define CPU_CCP6_bm  (1<<6)  /* CCP signature bit 6 mask. */
#define CPU_CCP6_bp  6  /* CCP signature bit 6 position. */
#define CPU_CCP7_bm  (1<<7)  /* CCP signature bit 7 mask. */
#define CPU_CCP7_bp  7  /* CCP signature bit 7 position. */

/* CPU.RAMPD  bit masks and bit positions */
#define CPU_RAMPD_gm  0xFF  /* Extended Direct Addressing bits group mask. */
#define CPU_RAMPD_gp  0  /* Extended Direct Addressing bits group position. */
#define CPU_RAMPD0_bm  (1<<0)  /* Extended Direct Addressing bits bit 0 mask. */
#define CPU_RAMPD0_bp  0  /* Extended Direct Addressing bits bit 0 position. */
#define CPU_RAMPD1_bm  (1<<1)  /* Extended Direct Addressing bits bit 1 mask. */
#define CPU_RAMPD1_bp  1  /* Extended Direct Addressing bits bit 1 position. */
#define CPU_RAMPD2_bm  (1<<2)  /* Extended Direct Addressing bits bit 2 mask. */
#define CPU_RAMPD2_bp  2  /* Extended Direct Addressing bits bit 2 position. */
#define CPU_RAMPD3_bm  (1<<3)  /* Extended Direct Addressing bits bit 3 mask. */
#define CPU_RAMPD3_bp  3  /* Extended Direct Addressing bits bit 3 position. */
#define CPU_RAMPD4_bm  (1<<4)  /* Extended Direct Addressing bits bit 4 mask. */
#define CPU_RAMPD4_bp  4  /* Extended Direct Addressing bits bit 4 position. */
#define CPU_RAMPD5_bm  (1<<5)  /* Extended Direct Addressing bits bit 5 mask. */
#define CPU_RAMPD5_bp  5  /* Extended Direct Addressing bits bit 5 position. */
#define CPU_RAMPD6_bm  (1<<6)  /* Extended Direct Addressing bits bit 6 mask. */
#define CPU_RAMPD6_bp  6  /* Extended Direct Addressing bits bit 6 position. */
#define CPU_RAMPD7_bm  (1<<7)  /* Extended Direct Addressing bits bit 7 mask. */
#define CPU_RAMPD7_bp  7  /* Extended Direct Addressing bits bit 7 position. */

