gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/* PORT.PIN1CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PORT.PIN2CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PORT.PIN3CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PORT.PIN4CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PORT.PIN5CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PORT.PIN6CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PORT.PIN7CTRL  bit masks and bit positions */
/* PORT_ISC  is already defined. */
/* PORT_OPC  is already defined. */
/* PORT_INVEN  is already defined. */
/* PORT_SRLEN  is already defined. */

/* PWRCTRL - VDD2 PM Control */
/* PWRCTRL.PWRCRVDD2  bit masks and bit positions */
#define PWRCTRL_LSE_bm  0x01  /* VDD2 Enabled bit mask. */
#define PWRCTRL_LSE_bp  0  /* VDD2 Enabled bit position. */
#define PWRCTRL_LSD_bm  0x02  /* VDD2 Disabled bit mask. */
#define PWRCTRL_LSD_bp  1  /* VDD2 Disabled bit position. */

/* RST - Reset */
/* RST.STATUS  bit masks and bit positions */
#define RST_PORF_bm  0x01  /* Power-on Reset Flag bit mask. */
#define RST_PORF_bp  0  /* Power-on Reset Flag bit position. */
#define RST_EXTRF_bm  0x02  /* External Reset Flag bit mask. */
#define RST_EXTRF_bp  1  /* External Reset Flag bit position. */
#define RST_BORF_bm  0x04  /* Brown-out Reset Flag bit mask. */
#define RST_BORF_bp  2  /* Brown-out Reset Flag bit position. */
#define RST_WDRF_bm  0x08  /* Watchdog Reset Flag bit mask. */
#define RST_WDRF_bp  3  /* Watchdog Reset Flag bit position. */
#define RST_PDIRF_bm  0x10  /* Programming and Debug Interface Interface Reset Flag bit mask. */
#define RST_PDIRF_bp  4  /* Programming and Debug Interface Interface Reset Flag bit position. */
#define RST_FWRF_bm  0x20  /* Firmware Reset Flag bit mask. */
#define RST_FWRF_bp  5  /* Firmware Reset Flag bit position. */

/* RST.CTRL  bit masks and bit positions */
#define RST_FWRST_bm  0x01  /* Firmware Reset bit mask. */
#define RST_FWRST_bp  0  /* Firmware Reset bit position. */

/* SIGROW - Signature Row */
/* NVM_PROD_SIGNATURES.LOTNUM0  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LOTNUM0_gm  0xFF  /* Lot Number Byte 0, ASCII group mask. */
#define NVM_PROD_SIGNATURES_LOTNUM0_gp  0  /* Lot Number Byte 0, ASCII group position. */
#define NVM_PROD_SIGNATURES_LOTNUM00_bm  (1<<0)  /* Lot Number Byte 0, ASCII bit 0 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM00_bp  0  /* Lot Number Byte 0, ASCII bit 0 position. */
#define NVM_PROD_SIGNATURES_LOTNUM01_bm  (1<<1)  /* Lot Number Byte 0, ASCII bit 1 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM01_bp  1  /* Lot Number Byte 0, ASCII bit 1 position. */
#define NVM_PROD_SIGNATURES_LOTNUM02_bm  (1<<2)  /* Lot Number Byte 0, ASCII bit 2 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM02_bp  2  /* Lot Number Byte 0, ASCII bit 2 position. */
#define NVM_PROD_SIGNATURES_LOTNUM03_bm  (1<<3)  /* Lot Number Byte 0, ASCII bit 3 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM03_bp  3  /* Lot Number Byte 0, ASCII bit 3 position. */
#define NVM_PROD_SIGNATURES_LOTNUM04_bm  (1<<4)  /* Lot Number Byte 0, ASCII bit 4 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM04_bp  4  /* Lot Number Byte 0, ASCII bit 4 position. */
#define NVM_PROD_SIGNATURES_LOTNUM05_bm  (1<<5)  /* Lot Number Byte 0, ASCII bit 5 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM05_bp  5  /* Lot Number Byte 0, ASCII bit 5 position. */
#define NVM_PROD_SIGNATURES_LOTNUM06_bm  (1<<6)  /* Lot Number Byte 0, ASCII bit 6 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM06_bp  6  /* Lot Number Byte 0, ASCII bit 6 position. */
#define NVM_PROD_SIGNATURES_LOTNUM07_bm  (1<<7)  /* Lot Number Byte 0, ASCII bit 7 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM07_bp  7  /* Lot Number Byte 0, ASCII bit 7 position. */

/* NVM_PROD_SIGNATURES.LOTNUM1  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_LOTNUM1_gm  0xFF  /* Lot Number Byte 1, ASCII group mask. */
#define NVM_PROD_SIGNATURES_LOTNUM1_gp  0  /* Lot Number Byte 1, ASCII group position. */
#define NVM_PROD_SIGNATURES_LOTNUM10_bm  (1<<0)  /* Lot Number Byte 1, ASCII bit 0 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM10_bp  0  /* Lot Number Byte 1, ASCII bit 0 position. */
#define NVM_PROD_SIGNATURES_LOTNUM11_bm  (1<<1)  /* Lot Number Byte 1, ASCII bit 1 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM11_bp  1  /* Lot Number Byte 1, ASCII bit 1 position. */
#define NVM_PROD_SIGNATURES_LOTNUM12_bm  (1<<2)  /* Lot Number Byte 1, ASCII bit 2 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM12_bp  2  /* Lot Number Byte 1, ASCII bit 2 position. */
#define NVM_PROD_SIGNATURES_LOTNUM13_bm  (1<<3)  /* Lot Number Byte 1, ASCII bit 3 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM13_bp  3  /* Lot Number Byte 1, ASCII bit 3 position. */
#define NVM_PROD_SIGNATURES_LOTNUM14_bm  (1<<4)  /* Lot Number Byte 1, ASCII bit 4 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM14_bp  4  /* Lot Number Byte 1, ASCII bit 4 position. */
#define NVM_PROD_SIGNATURES_LOTNUM15_bm  (1<<5)  /* Lot Number Byte 1, ASCII bit 5 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM15_bp  5  /* Lot Number Byte 1, ASCII bit 5 position. */
#define NVM_PROD_SIGNATURES_LOTNUM16_bm  (1<<6)  /* Lot Number Byte 1, ASCII bit 6 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM16_bp  6  /* Lot Number Byte 1, ASCII bit 6 position. */
#define NVM_PROD_SIGNATURES_LOTNUM17_bm  (1<<7)  /* Lot Number Byte 1, ASCII bit 7 mask. */
#define NVM_PROD_SIGNATURES_LOTNUM17_bp  7  /* Lot Number Byte 1, ASCII bit 7 position. */

