gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/* STYLUSCOM.CTRLF  bit masks and bit positions */
#define STYLUSCOM_ADBEN_bm  0x01  /* Abort debug enable bit mask. */
#define STYLUSCOM_ADBEN_bp  0  /* Abort debug enable bit position. */
#define STYLUSCOM_HFES_bm  0x08  /* Header first edge search bit mask. */
#define STYLUSCOM_HFES_bp  3  /* Header first edge search bit position. */
#define STYLUSCOM_CTHD_bm  0x10  /* Clamptip header disable bit mask. */
#define STYLUSCOM_CTHD_bp  4  /* Clamptip header disable bit position. */

/* STYLUSCOM.EDFILT  bit masks and bit positions */
#define STYLUSCOM_EDFEN_bm  0x01  /* Edge detector filter enable bit mask. */
#define STYLUSCOM_EDFEN_bp  0  /* Edge detector filter enable bit position. */
#define STYLUSCOM_FCNT_gm  0x7E  /* Filter counter group mask. */
#define STYLUSCOM_FCNT_gp  1  /* Filter counter group position. */
#define STYLUSCOM_FCNT0_bm  (1<<1)  /* Filter counter bit 0 mask. */
#define STYLUSCOM_FCNT0_bp  1  /* Filter counter bit 0 position. */
#define STYLUSCOM_FCNT1_bm  (1<<2)  /* Filter counter bit 1 mask. */
#define STYLUSCOM_FCNT1_bp  2  /* Filter counter bit 1 position. */
#define STYLUSCOM_FCNT2_bm  (1<<3)  /* Filter counter bit 2 mask. */
#define STYLUSCOM_FCNT2_bp  3  /* Filter counter bit 2 position. */
#define STYLUSCOM_FCNT3_bm  (1<<4)  /* Filter counter bit 3 mask. */
#define STYLUSCOM_FCNT3_bp  4  /* Filter counter bit 3 position. */
#define STYLUSCOM_FCNT4_bm  (1<<5)  /* Filter counter bit 4 mask. */
#define STYLUSCOM_FCNT4_bp  5  /* Filter counter bit 4 position. */
#define STYLUSCOM_FCNT5_bm  (1<<6)  /* Filter counter bit 5 mask. */
#define STYLUSCOM_FCNT5_bp  6  /* Filter counter bit 5 position. */

/* STYLUSCOM.TDS  bit masks and bit positions */
#define STYLUSCOM_TDS_gm  0x3F  /* Transmit Data Size group mask. */
#define STYLUSCOM_TDS_gp  0  /* Transmit Data Size group position. */
#define STYLUSCOM_TDS0_bm  (1<<0)  /* Transmit Data Size bit 0 mask. */
#define STYLUSCOM_TDS0_bp  0  /* Transmit Data Size bit 0 position. */
#define STYLUSCOM_TDS1_bm  (1<<1)  /* Transmit Data Size bit 1 mask. */
#define STYLUSCOM_TDS1_bp  1  /* Transmit Data Size bit 1 position. */
#define STYLUSCOM_TDS2_bm  (1<<2)  /* Transmit Data Size bit 2 mask. */
#define STYLUSCOM_TDS2_bp  2  /* Transmit Data Size bit 2 position. */
#define STYLUSCOM_TDS3_bm  (1<<3)  /* Transmit Data Size bit 3 mask. */
#define STYLUSCOM_TDS3_bp  3  /* Transmit Data Size bit 3 position. */
#define STYLUSCOM_TDS4_bm  (1<<4)  /* Transmit Data Size bit 4 mask. */
#define STYLUSCOM_TDS4_bp  4  /* Transmit Data Size bit 4 position. */
#define STYLUSCOM_TDS5_bm  (1<<5)  /* Transmit Data Size bit 5 mask. */
#define STYLUSCOM_TDS5_bp  5  /* Transmit Data Size bit 5 position. */

/* STYLUSCOM.TCNT  bit masks and bit positions */
#define STYLUSCOM_TCNT_gm  0x3F  /* Transmit Counter group mask. */
#define STYLUSCOM_TCNT_gp  0  /* Transmit Counter group position. */
#define STYLUSCOM_TCNT0_bm  (1<<0)  /* Transmit Counter bit 0 mask. */
#define STYLUSCOM_TCNT0_bp  0  /* Transmit Counter bit 0 position. */
#define STYLUSCOM_TCNT1_bm  (1<<1)  /* Transmit Counter bit 1 mask. */
#define STYLUSCOM_TCNT1_bp  1  /* Transmit Counter bit 1 position. */
#define STYLUSCOM_TCNT2_bm  (1<<2)  /* Transmit Counter bit 2 mask. */
#define STYLUSCOM_TCNT2_bp  2  /* Transmit Counter bit 2 position. */
#define STYLUSCOM_TCNT3_bm  (1<<3)  /* Transmit Counter bit 3 mask. */
#define STYLUSCOM_TCNT3_bp  3  /* Transmit Counter bit 3 position. */
#define STYLUSCOM_TCNT4_bm  (1<<4)  /* Transmit Counter bit 4 mask. */
#define STYLUSCOM_TCNT4_bp  4  /* Transmit Counter bit 4 position. */
#define STYLUSCOM_TCNT5_bm  (1<<5)  /* Transmit Counter bit 5 mask. */
#define STYLUSCOM_TCNT5_bp  5  /* Transmit Counter bit 5 position. */

/* STYLUSCOM.TDLYINIT  bit masks and bit positions */
#define STYLUSCOM_TDLYINIT_gm  0xFF  /* Transmit Delay Initial value group mask. */
#define STYLUSCOM_TDLYINIT_gp  0  /* Transmit Delay Initial value group position. */
#define STYLUSCOM_TDLYINIT0_bm  (1<<0)  /* Transmit Delay Initial value bit 0 mask. */
#define STYLUSCOM_TDLYINIT0_bp  0  /* Transmit Delay Initial value bit 0 position. */
#define STYLUSCOM_TDLYINIT1_bm  (1<<1)  /* Transmit Delay Initial value bit 1 mask. */
#define STYLUSCOM_TDLYINIT1_bp  1  /* Transmit Delay Initial value bit 1 position. */
#define STYLUSCOM_TDLYINIT2_bm  (1<<2)  /* Transmit Delay Initial value bit 2 mask. */
#define STYLUSCOM_TDLYINIT2_bp  2  /* Transmit Delay Initial value bit 2 position. */
#define STYLUSCOM_TDLYINIT3_bm  (1<<3)  /* Transmit Delay Initial value bit 3 mask. */
#define STYLUSCOM_TDLYINIT3_bp  3  /* Transmit Delay Initial value bit 3 position. */
#define STYLUSCOM_TDLYINIT4_bm  (1<<4)  /* Transmit Delay Initial value bit 4 mask. */
#define STYLUSCOM_TDLYINIT4_bp  4  /* Transmit Delay Initial value bit 4 position. */
#define STYLUSCOM_TDLYINIT5_bm  (1<<5)  /* Transmit Delay Initial value bit 5 mask. */
#define STYLUSCOM_TDLYINIT5_bp  5  /* Transmit Delay Initial value bit 5 position. */
#define STYLUSCOM_TDLYINIT6_bm  (1<<6)  /* Transmit Delay Initial value bit 6 mask. */
#define STYLUSCOM_TDLYINIT6_bp  6  /* Transmit Delay Initial value bit 6 position. */
#define STYLUSCOM_TDLYINIT7_bm  (1<<7)  /* Transmit Delay Initial value bit 7 mask. */
#define STYLUSCOM_TDLYINIT7_bp  7  /* Transmit Delay Initial value bit 7 position. */

/* STYLUSCOM.TDLYCLAMP  bit masks and bit positions */
#define STYLUSCOM_TDLYCLAMP_gm  0xFF  /* Transmit Delay for Receiver Clamp Tipe group mask. */
#define STYLUSCOM_TDLYCLAMP_gp  0  /* Transmit Delay for Receiver Clamp Tipe group position. */
#define STYLUSCOM_TDLYCLAMP0_bm  (1<<0)  /* Transmit Delay for Receiver Clamp Tipe bit 0 mask. */
#define STYLUSCOM_TDLYCLAMP0_bp  0  /* Transmit Delay for Receiver Clamp Tipe bit 0 position. */
#define STYLUSCOM_TDLYCLAMP1_bm  (1<<1)  /* Transmit Delay for Receiver Clamp Tipe bit 1 mask. */
#define STYLUSCOM_TDLYCLAMP1_bp  1  /* Transmit Delay for Receiver Clamp Tipe bit 1 position. */
#define STYLUSCOM_TDLYCLAMP2_bm  (1<<2)  /* Transmit Delay for Receiver Clamp Tipe bit 2 mask. */
#define STYLUSCOM_TDLYCLAMP2_bp  2  /* Transmit Delay for Receiver Clamp Tipe bit 2 position. */
#define STYLUSCOM_TDLYCLAMP3_bm  (1<<3)  /* Transmit Delay for Receiver Clamp Tipe bit 3 mask. */
#define STYLUSCOM_TDLYCLAMP3_bp  3  /* Transmit Delay for Receiver Clamp Tipe bit 3 position. */
#define STYLUSCOM_TDLYCLAMP4_bm  (1<<4)  /* Transmit Delay for Receiver Clamp Tipe bit 4 mask. */
#define STYLUSCOM_TDLYCLAMP4_bp  4  /* Transmit Delay for Receiver Clamp Tipe bit 4 position. */
#define STYLUSCOM_TDLYCLAMP5_bm  (1<<5)  /* Transmit Delay for Receiver Clamp Tipe bit 5 mask. */
#define STYLUSCOM_TDLYCLAMP5_bp  5  /* Transmit Delay for Receiver Clamp Tipe bit 5 position. */
#define STYLUSCOM_TDLYCLAMP6_bm  (1<<6)  /* Transmit Delay for Receiver Clamp Tipe bit 6 mask. */
#define STYLUSCOM_TDLYCLAMP6_bp  6  /* Transmit Delay for Receiver Clamp Tipe bit 6 position. */
#define STYLUSCOM_TDLYCLAMP7_bm  (1<<7)  /* Transmit Delay for Receiver Clamp Tipe bit 7 mask. */
#define STYLUSCOM_TDLYCLAMP7_bp  7  /* Transmit Delay for Receiver Clamp Tipe bit 7 position. */

