gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/* STYLUSCOM.RTWSM  bit masks and bit positions */
#define STYLUSCOM_WSM_gm  0xFF  /* Window Size Minimum value group mask. */
#define STYLUSCOM_WSM_gp  0  /* Window Size Minimum value group position. */
#define STYLUSCOM_WSM0_bm  (1<<0)  /* Window Size Minimum value bit 0 mask. */
#define STYLUSCOM_WSM0_bp  0  /* Window Size Minimum value bit 0 position. */
#define STYLUSCOM_WSM1_bm  (1<<1)  /* Window Size Minimum value bit 1 mask. */
#define STYLUSCOM_WSM1_bp  1  /* Window Size Minimum value bit 1 position. */
#define STYLUSCOM_WSM2_bm  (1<<2)  /* Window Size Minimum value bit 2 mask. */
#define STYLUSCOM_WSM2_bp  2  /* Window Size Minimum value bit 2 position. */
#define STYLUSCOM_WSM3_bm  (1<<3)  /* Window Size Minimum value bit 3 mask. */
#define STYLUSCOM_WSM3_bp  3  /* Window Size Minimum value bit 3 position. */
#define STYLUSCOM_WSM4_bm  (1<<4)  /* Window Size Minimum value bit 4 mask. */
#define STYLUSCOM_WSM4_bp  4  /* Window Size Minimum value bit 4 position. */
#define STYLUSCOM_WSM5_bm  (1<<5)  /* Window Size Minimum value bit 5 mask. */
#define STYLUSCOM_WSM5_bp  5  /* Window Size Minimum value bit 5 position. */
#define STYLUSCOM_WSM6_bm  (1<<6)  /* Window Size Minimum value bit 6 mask. */
#define STYLUSCOM_WSM6_bp  6  /* Window Size Minimum value bit 6 position. */
#define STYLUSCOM_WSM7_bm  (1<<7)  /* Window Size Minimum value bit 7 mask. */
#define STYLUSCOM_WSM7_bp  7  /* Window Size Minimum value bit 7 position. */

/* STYLUSCOM.RTWSI  bit masks and bit positions */
#define STYLUSCOM_WSI_gm  0xFF  /* Window Size for half-period - initial value group mask. */
#define STYLUSCOM_WSI_gp  0  /* Window Size for half-period - initial value group position. */
#define STYLUSCOM_WSI0_bm  (1<<0)  /* Window Size for half-period - initial value bit 0 mask. */
#define STYLUSCOM_WSI0_bp  0  /* Window Size for half-period - initial value bit 0 position. */
#define STYLUSCOM_WSI1_bm  (1<<1)  /* Window Size for half-period - initial value bit 1 mask. */
#define STYLUSCOM_WSI1_bp  1  /* Window Size for half-period - initial value bit 1 position. */
#define STYLUSCOM_WSI2_bm  (1<<2)  /* Window Size for half-period - initial value bit 2 mask. */
#define STYLUSCOM_WSI2_bp  2  /* Window Size for half-period - initial value bit 2 position. */
#define STYLUSCOM_WSI3_bm  (1<<3)  /* Window Size for half-period - initial value bit 3 mask. */
#define STYLUSCOM_WSI3_bp  3  /* Window Size for half-period - initial value bit 3 position. */
#define STYLUSCOM_WSI4_bm  (1<<4)  /* Window Size for half-period - initial value bit 4 mask. */
#define STYLUSCOM_WSI4_bp  4  /* Window Size for half-period - initial value bit 4 position. */
#define STYLUSCOM_WSI5_bm  (1<<5)  /* Window Size for half-period - initial value bit 5 mask. */
#define STYLUSCOM_WSI5_bp  5  /* Window Size for half-period - initial value bit 5 position. */
#define STYLUSCOM_WSI6_bm  (1<<6)  /* Window Size for half-period - initial value bit 6 mask. */
#define STYLUSCOM_WSI6_bp  6  /* Window Size for half-period - initial value bit 6 position. */
#define STYLUSCOM_WSI7_bm  (1<<7)  /* Window Size for half-period - initial value bit 7 mask. */
#define STYLUSCOM_WSI7_bp  7  /* Window Size for half-period - initial value bit 7 position. */

/* STYLUSCOM.RTWSU  bit masks and bit positions */
#define STYLUSCOM_WSU_gm  0xFF  /* Window Size Used group mask. */
#define STYLUSCOM_WSU_gp  0  /* Window Size Used group position. */
#define STYLUSCOM_WSU0_bm  (1<<0)  /* Window Size Used bit 0 mask. */
#define STYLUSCOM_WSU0_bp  0  /* Window Size Used bit 0 position. */
#define STYLUSCOM_WSU1_bm  (1<<1)  /* Window Size Used bit 1 mask. */
#define STYLUSCOM_WSU1_bp  1  /* Window Size Used bit 1 position. */
#define STYLUSCOM_WSU2_bm  (1<<2)  /* Window Size Used bit 2 mask. */
#define STYLUSCOM_WSU2_bp  2  /* Window Size Used bit 2 position. */
#define STYLUSCOM_WSU3_bm  (1<<3)  /* Window Size Used bit 3 mask. */
#define STYLUSCOM_WSU3_bp  3  /* Window Size Used bit 3 position. */
#define STYLUSCOM_WSU4_bm  (1<<4)  /* Window Size Used bit 4 mask. */
#define STYLUSCOM_WSU4_bp  4  /* Window Size Used bit 4 position. */
#define STYLUSCOM_WSU5_bm  (1<<5)  /* Window Size Used bit 5 mask. */
#define STYLUSCOM_WSU5_bp  5  /* Window Size Used bit 5 position. */
#define STYLUSCOM_WSU6_bm  (1<<6)  /* Window Size Used bit 6 mask. */
#define STYLUSCOM_WSU6_bp  6  /* Window Size Used bit 6 position. */
#define STYLUSCOM_WSU7_bm  (1<<7)  /* Window Size Used bit 7 mask. */
#define STYLUSCOM_WSU7_bp  7  /* Window Size Used bit 7 position. */

/* STYLUSCOM.RTCNT0L  bit masks and bit positions */
#define STYLUSCOM_RTCNT_gm  0xFF  /* Receive Timer/Counter value group mask. */
#define STYLUSCOM_RTCNT_gp  0  /* Receive Timer/Counter value group position. */
#define STYLUSCOM_RTCNT0_bm  (1<<0)  /* Receive Timer/Counter value bit 0 mask. */
#define STYLUSCOM_RTCNT0_bp  0  /* Receive Timer/Counter value bit 0 position. */
#define STYLUSCOM_RTCNT1_bm  (1<<1)  /* Receive Timer/Counter value bit 1 mask. */
#define STYLUSCOM_RTCNT1_bp  1  /* Receive Timer/Counter value bit 1 position. */
#define STYLUSCOM_RTCNT2_bm  (1<<2)  /* Receive Timer/Counter value bit 2 mask. */
#define STYLUSCOM_RTCNT2_bp  2  /* Receive Timer/Counter value bit 2 position. */
#define STYLUSCOM_RTCNT3_bm  (1<<3)  /* Receive Timer/Counter value bit 3 mask. */
#define STYLUSCOM_RTCNT3_bp  3  /* Receive Timer/Counter value bit 3 position. */
#define STYLUSCOM_RTCNT4_bm  (1<<4)  /* Receive Timer/Counter value bit 4 mask. */
#define STYLUSCOM_RTCNT4_bp  4  /* Receive Timer/Counter value bit 4 position. */
#define STYLUSCOM_RTCNT5_bm  (1<<5)  /* Receive Timer/Counter value bit 5 mask. */
#define STYLUSCOM_RTCNT5_bp  5  /* Receive Timer/Counter value bit 5 position. */
#define STYLUSCOM_RTCNT6_bm  (1<<6)  /* Receive Timer/Counter value bit 6 mask. */
#define STYLUSCOM_RTCNT6_bp  6  /* Receive Timer/Counter value bit 6 position. */
#define STYLUSCOM_RTCNT7_bm  (1<<7)  /* Receive Timer/Counter value bit 7 mask. */
#define STYLUSCOM_RTCNT7_bp  7  /* Receive Timer/Counter value bit 7 position. */

