gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/* STYLUSCOM.INTDBCTRL  bit masks and bit positions */
#define STYLUSCOM_DBSEL_gm  0x07  /* Debug Interrupt Selection group mask. */
#define STYLUSCOM_DBSEL_gp  0  /* Debug Interrupt Selection group position. */
#define STYLUSCOM_DBSEL0_bm  (1<<0)  /* Debug Interrupt Selection bit 0 mask. */
#define STYLUSCOM_DBSEL0_bp  0  /* Debug Interrupt Selection bit 0 position. */
#define STYLUSCOM_DBSEL1_bm  (1<<1)  /* Debug Interrupt Selection bit 1 mask. */
#define STYLUSCOM_DBSEL1_bp  1  /* Debug Interrupt Selection bit 1 position. */
#define STYLUSCOM_DBSEL2_bm  (1<<2)  /* Debug Interrupt Selection bit 2 mask. */
#define STYLUSCOM_DBSEL2_bp  2  /* Debug Interrupt Selection bit 2 position. */

/* STYLUSCOM.INTFLAGS  bit masks and bit positions */
#define STYLUSCOM_ETIF_bm  0x01  /* End of Pulse Train Interrupt Flag bit mask. */
#define STYLUSCOM_ETIF_bp  0  /* End of Pulse Train Interrupt Flag bit position. */
#define STYLUSCOM_ASIF_bm  0x02  /* Abort Status Interrupt Flag bit mask. */
#define STYLUSCOM_ASIF_bp  1  /* Abort Status Interrupt Flag bit position. */
#define STYLUSCOM_EHIF_bm  0x04  /* End of Header Interrupt Flag bit mask. */
#define STYLUSCOM_EHIF_bp  2  /* End of Header Interrupt Flag bit position. */
#define STYLUSCOM_SHIF_bm  0x08  /* Start of Header Interrupt Flag bit mask. */
#define STYLUSCOM_SHIF_bp  3  /* Start of Header Interrupt Flag bit position. */
#define STYLUSCOM_DBIF_bm  0x10  /* Debug Interrupt Flag bit mask. */
#define STYLUSCOM_DBIF_bp  4  /* Debug Interrupt Flag bit position. */
#define STYLUSCOM_TEIF_bm  0x20  /* Transmit on estimated edges Interrupt Flag bit mask. */
#define STYLUSCOM_TEIF_bp  5  /* Transmit on estimated edges Interrupt Flag bit position. */
#define STYLUSCOM_DCIF_bm  0x40  /* Data complete Interrupt Flag bit mask. */
#define STYLUSCOM_DCIF_bp  6  /* Data complete Interrupt Flag bit position. */

/* STYLUSCOM.STATUS  bit masks and bit positions */
#define STYLUSCOM_AS_gm  0x03  /* Abort Status group mask. */
#define STYLUSCOM_AS_gp  0  /* Abort Status group position. */
#define STYLUSCOM_AS0_bm  (1<<0)  /* Abort Status bit 0 mask. */
#define STYLUSCOM_AS0_bp  0  /* Abort Status bit 0 position. */
#define STYLUSCOM_AS1_bm  (1<<1)  /* Abort Status bit 1 mask. */
#define STYLUSCOM_AS1_bp  1  /* Abort Status bit 1 position. */
#define STYLUSCOM_RT1MC_bm  0x04  /* Receive Timer 1 is Mark Counter bit mask. */
#define STYLUSCOM_RT1MC_bp  2  /* Receive Timer 1 is Mark Counter bit position. */
#define STYLUSCOM_TEEST_bm  0x08  /* Transmission at Estimated Edges Started bit mask. */
#define STYLUSCOM_TEEST_bp  3  /* Transmission at Estimated Edges Started bit position. */
#define STYLUSCOM_TEEREC_bm  0x10  /* Transmission at Estimated Edges recovered bit mask. */
#define STYLUSCOM_TEEREC_bp  4  /* Transmission at Estimated Edges recovered bit position. */
#define STYLUSCOM_TEECNTZ_bm  0x20  /* Transmission at Estimated Edges Counter zero bit mask. */
#define STYLUSCOM_TEECNTZ_bp  5  /* Transmission at Estimated Edges Counter zero bit position. */
#define STYLUSCOM_TDDONE_bm  0x40  /* Transmission Data Done bit mask. */
#define STYLUSCOM_TDDONE_bp  6  /* Transmission Data Done bit position. */
#define STYLUSCOM_THDONE_bm  0x80  /* Transmission Header Done bit mask. */
#define STYLUSCOM_THDONE_bp  7  /* Transmission Header Done bit position. */

/* TIM8_16 - Timer 8/16 bit */
/* TIM8_16.CTRLA  bit masks and bit positions */
#define TIM8_16_CTC_bm  0x01  /* Clear Timer on Compare Match Mode bit mask. */
#define TIM8_16_CTC_bp  0  /* Clear Timer on Compare Match Mode bit position. */
#define TIM8_16_ICES_bm  0x10  /* Input Capture Edge Select bit mask. */
#define TIM8_16_ICES_bp  4  /* Input Capture Edge Select bit position. */
#define TIM8_16_ICNC_bm  0x20  /* Input Capture Noise Canceller bit mask. */
#define TIM8_16_ICNC_bp  5  /* Input Capture Noise Canceller bit position. */
#define TIM8_16_ICEN_bm  0x40  /* Input Capture Mode Enable bit mask. */
#define TIM8_16_ICEN_bp  6  /* Input Capture Mode Enable bit position. */
#define TIM8_16_WORDM_bm  0x80  /* Word (16-bit) Mode bit mask. */
#define TIM8_16_WORDM_bp  7  /* Word (16-bit) Mode bit position. */

/* TIM8_16.CTRLB  bit masks and bit positions */
#define TIM8_16_CS_gm  0x0F  /* Clock Select group mask. */
#define TIM8_16_CS_gp  0  /* Clock Select group position. */
#define TIM8_16_CS0_bm  (1<<0)  /* Clock Select bit 0 mask. */
#define TIM8_16_CS0_bp  0  /* Clock Select bit 0 position. */
#define TIM8_16_CS1_bm  (1<<1)  /* Clock Select bit 1 mask. */
#define TIM8_16_CS1_bp  1  /* Clock Select bit 1 position. */
#define TIM8_16_CS2_bm  (1<<2)  /* Clock Select bit 2 mask. */
#define TIM8_16_CS2_bp  2  /* Clock Select bit 2 position. */
#define TIM8_16_CS3_bm  (1<<3)  /* Clock Select bit 3 mask. */
#define TIM8_16_CS3_bp  3  /* Clock Select bit 3 position. */
#define TIM8_16_ICS_gm  0x70  /* Input Capture Select group mask. */
#define TIM8_16_ICS_gp  4  /* Input Capture Select group position. */
#define TIM8_16_ICS0_bm  (1<<4)  /* Input Capture Select bit 0 mask. */
#define TIM8_16_ICS0_bp  4  /* Input Capture Select bit 0 position. */
#define TIM8_16_ICS1_bm  (1<<5)  /* Input Capture Select bit 1 mask. */
#define TIM8_16_ICS1_bp  5  /* Input Capture Select bit 1 position. */
#define TIM8_16_ICS2_bm  (1<<6)  /* Input Capture Select bit 2 mask. */
#define TIM8_16_ICS2_bp  6  /* Input Capture Select bit 2 position. */

/* TIM8_16.INTMSK  bit masks and bit positions */
#define TIM8_16_OVFILVL_gm  0x03  /* Overflow Interrupt Level group mask. */
#define TIM8_16_OVFILVL_gp  0  /* Overflow Interrupt Level group position. */
#define TIM8_16_OVFILVL0_bm  (1<<0)  /* Overflow Interrupt Level bit 0 mask. */
#define TIM8_16_OVFILVL0_bp  0  /* Overflow Interrupt Level bit 0 position. */
#define TIM8_16_OVFILVL1_bm  (1<<1)  /* Overflow Interrupt Level bit 1 mask. */
#define TIM8_16_OVFILVL1_bp  1  /* Overflow Interrupt Level bit 1 position. */
#define TIM8_16_OCAILVL_gm  0x0C  /* Output Compare Match A Interrupt Level group mask. */
#define TIM8_16_OCAILVL_gp  2  /* Output Compare Match A Interrupt Level group position. */
#define TIM8_16_OCAILVL0_bm  (1<<2)  /* Output Compare Match A Interrupt Level bit 0 mask. */
#define TIM8_16_OCAILVL0_bp  2  /* Output Compare Match A Interrupt Level bit 0 position. */
#define TIM8_16_OCAILVL1_bm  (1<<3)  /* Output Compare Match A Interrupt Level bit 1 mask. */
#define TIM8_16_OCAILVL1_bp  3  /* Output Compare Match A Interrupt Level bit 1 position. */
#define TIM8_16_OCBILVL_gm  0x30  /* Output Compare Match B Interrupt Level group mask. */
#define TIM8_16_OCBILVL_gp  4  /* Output Compare Match B Interrupt Level group position. */
#define TIM8_16_OCBILVL0_bm  (1<<4)  /* Output Compare Match B Interrupt Level bit 0 mask. */
#define TIM8_16_OCBILVL0_bp  4  /* Output Compare Match B Interrupt Level bit 0 position. */
#define TIM8_16_OCBILVL1_bm  (1<<5)  /* Output Compare Match B Interrupt Level bit 1 mask. */
#define TIM8_16_OCBILVL1_bp  5  /* Output Compare Match B Interrupt Level bit 1 position. */
#define TIM8_16_ICILVL_gm  0xC0  /* Input Capture Interrupt Level group mask. */
#define TIM8_16_ICILVL_gp  6  /* Input Capture Interrupt Level group position. */
#define TIM8_16_ICILVL0_bm  (1<<6)  /* Input Capture Interrupt Level bit 0 mask. */
#define TIM8_16_ICILVL0_bp  6  /* Input Capture Interrupt Level bit 0 position. */
#define TIM8_16_ICILVL1_bm  (1<<7)  /* Input Capture Interrupt Level bit 1 mask. */
#define TIM8_16_ICILVL1_bp  7  /* Input Capture Interrupt Level bit 1 position. */

