gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts200.h
/* TWI_MASTER.DATA  bit masks and bit positions */
#define TWI_MASTER_DATA_gm  0xFF  /* Address Register group mask. */
#define TWI_MASTER_DATA_gp  0  /* Address Register group position. */
#define TWI_MASTER_DATA0_bm  (1<<0)  /* Address Register bit 0 mask. */
#define TWI_MASTER_DATA0_bp  0  /* Address Register bit 0 position. */
#define TWI_MASTER_DATA1_bm  (1<<1)  /* Address Register bit 1 mask. */
#define TWI_MASTER_DATA1_bp  1  /* Address Register bit 1 position. */
#define TWI_MASTER_DATA2_bm  (1<<2)  /* Address Register bit 2 mask. */
#define TWI_MASTER_DATA2_bp  2  /* Address Register bit 2 position. */
#define TWI_MASTER_DATA3_bm  (1<<3)  /* Address Register bit 3 mask. */
#define TWI_MASTER_DATA3_bp  3  /* Address Register bit 3 position. */
#define TWI_MASTER_DATA4_bm  (1<<4)  /* Address Register bit 4 mask. */
#define TWI_MASTER_DATA4_bp  4  /* Address Register bit 4 position. */
#define TWI_MASTER_DATA5_bm  (1<<5)  /* Address Register bit 5 mask. */
#define TWI_MASTER_DATA5_bp  5  /* Address Register bit 5 position. */
#define TWI_MASTER_DATA6_bm  (1<<6)  /* Address Register bit 6 mask. */
#define TWI_MASTER_DATA6_bp  6  /* Address Register bit 6 position. */
#define TWI_MASTER_DATA7_bm  (1<<7)  /* Address Register bit 7 mask. */
#define TWI_MASTER_DATA7_bp  7  /* Address Register bit 7 position. */

/* TWI_SLAVE.CTRLA  bit masks and bit positions */
#define TWI_SLAVE_SMEN_bm  0x01  /* Smart Mode Enable bit mask. */
#define TWI_SLAVE_SMEN_bp  0  /* Smart Mode Enable bit position. */
#define TWI_SLAVE_PMEN_bm  0x02  /* Promiscuous Mode Enable bit mask. */
#define TWI_SLAVE_PMEN_bp  1  /* Promiscuous Mode Enable bit position. */
#define TWI_SLAVE_PIEN_bm  0x04  /* Stop Interrupt Enable bit mask. */
#define TWI_SLAVE_PIEN_bp  2  /* Stop Interrupt Enable bit position. */
#define TWI_SLAVE_ENABLE_bm  0x08  /* Enable TWI Slave bit mask. */
#define TWI_SLAVE_ENABLE_bp  3  /* Enable TWI Slave bit position. */
#define TWI_SLAVE_APIEN_bm  0x10  /* Address/Stop Interrupt Enable bit mask. */
#define TWI_SLAVE_APIEN_bp  4  /* Address/Stop Interrupt Enable bit position. */
#define TWI_SLAVE_DIEN_bm  0x20  /* Data Interrupt Enable bit mask. */
#define TWI_SLAVE_DIEN_bp  5  /* Data Interrupt Enable bit position. */
#define TWI_SLAVE_INTLVL_gm  0xC0  /* Interrupt Level group mask. */
#define TWI_SLAVE_INTLVL_gp  6  /* Interrupt Level group position. */
#define TWI_SLAVE_INTLVL0_bm  (1<<6)  /* Interrupt Level bit 0 mask. */
#define TWI_SLAVE_INTLVL0_bp  6  /* Interrupt Level bit 0 position. */
#define TWI_SLAVE_INTLVL1_bm  (1<<7)  /* Interrupt Level bit 1 mask. */
#define TWI_SLAVE_INTLVL1_bp  7  /* Interrupt Level bit 1 position. */

/* TWI_SLAVE.CTRLB  bit masks and bit positions */
#define TWI_SLAVE_CMD_gm  0x03  /* Command group mask. */
#define TWI_SLAVE_CMD_gp  0  /* Command group position. */
#define TWI_SLAVE_CMD0_bm  (1<<0)  /* Command bit 0 mask. */
#define TWI_SLAVE_CMD0_bp  0  /* Command bit 0 position. */
#define TWI_SLAVE_CMD1_bm  (1<<1)  /* Command bit 1 mask. */
#define TWI_SLAVE_CMD1_bp  1  /* Command bit 1 position. */
#define TWI_SLAVE_ACKACT_bm  0x04  /* Acknowledge Action bit mask. */
#define TWI_SLAVE_ACKACT_bp  2  /* Acknowledge Action bit position. */

/* TWI_SLAVE.STATUS  bit masks and bit positions */
#define TWI_SLAVE_AP_bm  0x01  /* Slave Address or Stop bit mask. */
#define TWI_SLAVE_AP_bp  0  /* Slave Address or Stop bit position. */
#define TWI_SLAVE_DIR_bm  0x02  /* Read/Write Direction bit mask. */
#define TWI_SLAVE_DIR_bp  1  /* Read/Write Direction bit position. */
#define TWI_SLAVE_BUSERR_bm  0x04  /* Bus Error bit mask. */
#define TWI_SLAVE_BUSERR_bp  2  /* Bus Error bit position. */
#define TWI_SLAVE_COLL_bm  0x08  /* Collision bit mask. */
#define TWI_SLAVE_COLL_bp  3  /* Collision bit position. */
#define TWI_SLAVE_RXACK_bm  0x10  /* Received Acknowledge bit mask. */
#define TWI_SLAVE_RXACK_bp  4  /* Received Acknowledge bit position. */
#define TWI_SLAVE_CLKHOLD_bm  0x20  /* Clock Hold bit mask. */
#define TWI_SLAVE_CLKHOLD_bp  5  /* Clock Hold bit position. */
#define TWI_SLAVE_APIF_bm  0x40  /* Address/Stop Interrupt Flag bit mask. */
#define TWI_SLAVE_APIF_bp  6  /* Address/Stop Interrupt Flag bit position. */
#define TWI_SLAVE_DIF_bm  0x80  /* Data Interrupt Flag bit mask. */
#define TWI_SLAVE_DIF_bp  7  /* Data Interrupt Flag bit position. */

/* TWI_SLAVE.ADDR  bit masks and bit positions */
#define TWI_SLAVE_ADDR_gm  0xFF  /* Address Register group mask. */
#define TWI_SLAVE_ADDR_gp  0  /* Address Register group position. */
#define TWI_SLAVE_ADDR0_bm  (1<<0)  /* Address Register bit 0 mask. */
#define TWI_SLAVE_ADDR0_bp  0  /* Address Register bit 0 position. */
#define TWI_SLAVE_ADDR1_bm  (1<<1)  /* Address Register bit 1 mask. */
#define TWI_SLAVE_ADDR1_bp  1  /* Address Register bit 1 position. */
#define TWI_SLAVE_ADDR2_bm  (1<<2)  /* Address Register bit 2 mask. */
#define TWI_SLAVE_ADDR2_bp  2  /* Address Register bit 2 position. */
#define TWI_SLAVE_ADDR3_bm  (1<<3)  /* Address Register bit 3 mask. */
#define TWI_SLAVE_ADDR3_bp  3  /* Address Register bit 3 position. */
#define TWI_SLAVE_ADDR4_bm  (1<<4)  /* Address Register bit 4 mask. */
#define TWI_SLAVE_ADDR4_bp  4  /* Address Register bit 4 position. */
#define TWI_SLAVE_ADDR5_bm  (1<<5)  /* Address Register bit 5 mask. */
#define TWI_SLAVE_ADDR5_bp  5  /* Address Register bit 5 position. */
#define TWI_SLAVE_ADDR6_bm  (1<<6)  /* Address Register bit 6 mask. */
#define TWI_SLAVE_ADDR6_bp  6  /* Address Register bit 6 position. */
#define TWI_SLAVE_ADDR7_bm  (1<<7)  /* Address Register bit 7 mask. */
#define TWI_SLAVE_ADDR7_bp  7  /* Address Register bit 7 position. */

/* TWI_SLAVE.DATA  bit masks and bit positions */
#define TWI_SLAVE_DATA_gm  0xFF  /* Data Register group mask. */
#define TWI_SLAVE_DATA_gp  0  /* Data Register group position. */
#define TWI_SLAVE_DATA0_bm  (1<<0)  /* Data Register bit 0 mask. */
#define TWI_SLAVE_DATA0_bp  0  /* Data Register bit 0 position. */
#define TWI_SLAVE_DATA1_bm  (1<<1)  /* Data Register bit 1 mask. */
#define TWI_SLAVE_DATA1_bp  1  /* Data Register bit 1 position. */
#define TWI_SLAVE_DATA2_bm  (1<<2)  /* Data Register bit 2 mask. */
#define TWI_SLAVE_DATA2_bp  2  /* Data Register bit 2 position. */
#define TWI_SLAVE_DATA3_bm  (1<<3)  /* Data Register bit 3 mask. */
#define TWI_SLAVE_DATA3_bp  3  /* Data Register bit 3 position. */
#define TWI_SLAVE_DATA4_bm  (1<<4)  /* Data Register bit 4 mask. */
#define TWI_SLAVE_DATA4_bp  4  /* Data Register bit 4 position. */
#define TWI_SLAVE_DATA5_bm  (1<<5)  /* Data Register bit 5 mask. */
#define TWI_SLAVE_DATA5_bp  5  /* Data Register bit 5 position. */
#define TWI_SLAVE_DATA6_bm  (1<<6)  /* Data Register bit 6 mask. */
#define TWI_SLAVE_DATA6_bp  6  /* Data Register bit 6 position. */
#define TWI_SLAVE_DATA7_bm  (1<<7)  /* Data Register bit 7 mask. */
#define TWI_SLAVE_DATA7_bp  7  /* Data Register bit 7 position. */

